//сам. раб. 2 B29
#include <iostream>
using namespace std;

int main() {
int x, y, x1, y1, x2, y2;
cout << "Введите x и y: ";
cin >> x >> y;
cout << "Введите координаты верхнего левого угла: ";
cin >> x1 >> y1;
cout << "Введите координаты правого нижнего угла: ";
cin >> x2 >> y2;
if(x > x1 && x < x2 && y > y1 && y < y2) {
    cout << "Точка (" << x << ", " << y << ") лежит внутри прямоугольника." << endl;
}
else {
    cout << "Точка (" << x << ", " << y << ") не лежит внутри прямоугольника." << endl;
}

return 0;
}