// 4 урок баз. 3.2
#include <iostream>
using namespace std;

int main() {
    int arr[7][7] = {{1, -2, 3, 4, -5, 6, 7},
                     {8, -9, 10, -11, 12, 13, 14},
                     {15, 16, -17, 18, 19, -20, 21},
                     {22, -23, 24, 25, 26, -27, 28},
                     {29, 30, -31, 32, -33, 34, 35},
                     {-36, 37, 38, -39, 40, 41, -42},
                     {43, -44, 45, 46, 47, -48, 49}};

    int sum = 0;
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < 7; j++) {
            if (arr[i][j] < 0 && arr[i][j] % 2 != 0) {
                sum += abs(arr[i][j]); 
            }
        }
    }

    cout << "Сумма модулей отрицательных нечетных элементов: " << sum << endl;

    return 0;
}
 