//сам раб 4 баз 3.20


#include <iostream>
using namespace std;

int main() {
    int arr[6][8] = { {1,-2,3,-4,5,-6,7,-8},
                      {2,-3,4,-5,6,-7,8,-9},
                      {3,-4,5,-6,7,-8,9,-10},
                      {4,-5,6,-7,8,-9,10,-11},
                      {5,-6,7,-8,9,-10,11,-12},
                      {6,-7,8,-9,10,-11,12,-13} };
    int prod = 1; 
    for(int i=0; i<6; i++) {
        if(arr[i][0] > 0) {
            prod *= arr[i][0];
        }
    }
    cout << "Произведение положительных элементов первого столбца: " << prod << endl;
    return 0;
}


